[
  {
    "dates": "Spring 2021 - Fall 2023",
    "position": "Senior Software Engineer & Front-End Tech Leadership",
    "company": "Brace.ai",
    "description": "Over four years, I  participated in all aspects of product development lifecycle from planning through execution. I was responsible for developing and maintaining the front-end of each application, working closely with the design team to create seamless user experiences. Most recently, as part of the tech leadership team, I planned, developed, executed, and maintained aspects of a software development life cycle for the frontend/UX with the goal to design and develop robust, scalable, and secure solutions, ensuring high performance and user satisfaction. ",
    "tags": ["HTML/CSS", "React", "Typescript", "Redux", "highCharts"]
  },
  {
    "dates": "Fall 2019 - Spring 2021",
    "position": "Software Engineer I & II",
    "company": "Brace.ai",
    "description": "Starting out as one of only two frontend engineers, I had a big part in digitizing an 80 year old federal process from 70+ printed pages into a short, dynamic, all-inclusive web-based form and user site. ",
    "tags": ["HTML/CSS", "React", "Typescript", "Jest"]
  },
  {
    "dates": "Fall 2017- 2019",
    "position": "Fullstack Software Developer",
    "company": "Aeroasis LLC",
    "tags": [
      "Squarespace",
      "Mobile first",
      "Shopify",
      "Square integration",
      "HTML/CSS",
      "React",
      "React Native",
      "D3",
      "IOS",
      "Android",
      "IoT",
      "Nodejs",
      "AWS"
    ],
    "description": "As the sole in-house software engineer, I managed and led in the development of all Aeroasis software endevours including rebuilding the public website, which resulted in a 200% increase in visitor traffic and improved company SEO. I created and maintained the company shop through Shopify, paypal, and Square. I developed the Aeroasis Grow App: an IoT connected mobile user app that maintained and controled an indoor garden ecosystem. In addition, I developed an education curricula and built a web platform for teachers and educators to access and interact with our lesson plans."
  },
  {
    "dates": "2017-2018",
    "position": "Fullstack Software Developer",
    "company": "Freelance",
    "tags": [
      "React",
      "Mobile first",
      "Javascript es6",
      "Bootstrap",
      "Google Cloud",
      "SASS"
    ],
    "description": "I crafted impactful and engaging online presences for a variety of small businesses. I translated client needs into effective web solutions. Throughout I managed the web application projects and development from conception through launch."
  },
  {
    "dates": "2014-2016",
    "position": "Manager of Community Outreach",
    "company": "Children's Museum of Manhattan",
    "tags": [
      "Drupal",
      "Community Outreach",
      "Public Education",
      "Event Planning",
      "Management"
    ],
    "description": "I provided strategic leadership and hands-on management for the museum's community outreach programs, education initiatives and community services. I managed a team of educators, interns and volunteers."
  },
  {
    "dates": "2011-2014",
    "position": "Education Coordinator",
    "company": "Children's Aid Society",
    "tags": [
      "Salesforce",
      "Technology Integration",
      "Public Education",
      "Management"
    ],
    "description": "I coordinated support services for students in a 5-12 grade public school. This included curriculum development, teacher training, and student support services. I managed a team of educators."
  },
  {
    "dates": "Before 2011",
    "position": "Lead Special Education Teacher",
    "company": "NYC Department of Education",
    "tags": [
      "Curriculum Development",
      "Technology Integration",
      "STEM Education",
      "Management"
    ],
    "description": "I helped found a small school with a focus on STEM education. I advised and taught middle and high school math, social studies, English and literacy, and art in general and special education settings."
  }
]
