[
  {
    "id": "brace",
    "title": "Brace.ai: Stavvy",
    "role": "Front-end tech leadership & Senior Software Developer",
    "date": "2019-2023",
    "description": "Brace was a software-as-a-service (saas) technology provider whose focus was in the mortgage servicing space. It is an end-to-end mortgage servicing software for loss mitigation.   Over four years, I  participated in all aspects of product development lifecycle from planning through execution. I was responsible for developing and maintaining the front-end of each application, working closely with the design team to create seamless user experiences.",
    "image": { "url": "/src/assets/brace-Hero-Shot.jpeg" },
    "link": "/portfolio/brace",
    "externalLink": "https://stavvy.com/mortgage-servicing-solution"
  },
  {
    "id": "cayor",
    "title": "Cayor Capital",
    "role": "Full Stack Developer",
    "tags": [
      "React",
      "Mobile first",
      "Javascript es6",
      "Bootstrap",
      "Google Cloud",
      "SASS"
    ],
    "description": "Cayor Capital launched in 2015, as a Sub-Saharan Africa equity fund, focusing on mid-market assets and investments. Upon reaching their investment goal, Cayor required a website update. I worked with the Cayor team to design and develop and maintain thier new, responsive single page app to attract future investments.\n My approach to Cayor was to advocate for a fresh, updated interface that put the investors and portfolio companies first. To make the site user-friendly, we focused on breathing life into the Company decks and transforming the details into designed pages.",
    "image": { "url": "/src/assets/cayor.png" },
    "link": "portfolio/cayor"
  },
  {
    "id": "aeroasis",
    "title": "Aeroasis",
    "role": "Full Stack Developer",
    "tags": [
      "Squarespace",
      "Mobile first",
      "Shopify",
      "Square integration",
      "HTML/CSS",
      "React",
      "React Native",
      "D3",
      "IOS",
      "Android",
      "IoT",
      "Nodejs",
      "AWS"
    ],
    "date": "2017 - 2019",
    "description": "Aeroasis was a resource autonomy startup with a strong focus on education.  Aeroasis flagship product was an IoT indoor home garden system that combined innovative technology with intuitive mobile design to seamlessly grow produce.",
    "image": { "url": "/src/assets/mobile.jpg" },
    "link": "portfolio/aeroasis"
  }
]
